#+OPTIONS: toc:3 h:3
#+OPTIONS: ^:nil
#+PROPERTY: header-args :tangle yes
#+HTML_HEAD: <style>
#+HTML_HEAD:     table { border: 1px solid black; border-collapse:collapse; margin-left: 2%; }
#+HTML_HEAD:     th.org-left   { border: 1px solid black; text-align: left; background-color: lightgray  }
#+HTML_HEAD:     td.org-left   { border: 1px solid black; text-align: left; font-family: monospace; }
#+HTML_HEAD: </style>
#+AUTHOR: Bob Forgey
#+EMAIL: bob@grumpydogconsulting.com
#+TITLE: A _Literate_ and _Fairly Portable_ Emacs Initialization

#+begin_quote
Emacs outshines all other editing software in approximately the same
way that the noonday sun does the stars. It is not just bigger and
brighter; it simply makes everything else vanish.

-- Neal Stephenson, "In the Beginning was the Command Line"
#+end_quote

#+begin_quote
"This is the thing you don't understand. No one quits Emacs; they just
get old and die."

Programmers are also human - https://youtu.be/urcL86UpqZc
#+end_quote

*** org-agenda-custom-commands → long list of agenda definitions
#+begin_src emacs-lisp
  (setq org-agenda-custom-commands
        '(("cd" "DONE TODOs sorted by date"
           todo "DONE"
           ((org-agenda-overriding-header "\nTODOs sorted by state, priority, effort")
            (org-agenda-sorting-strategy '(todo-state-down time-down))))))
#+end_src
#+begin_src emacs-lisp
                                          ;  (setq org-agenda-custom-commands
                                          ;        (quote (
                                          ;
                                          ;                ("b" "Super Agenda" agenda ""
                                          ;                 (org-super-agenda-mode)
                                          ;                 ((org-super-agenda-groups my-super-agenda-groups))
                                          ;                 (org-agenda nil "a"))
                                          ;
                                          ;                ("A" "Agenda" agenda ""
                                          ;                 (org-agenda nil "a"))
                                          ;
                                          ;                ("n" "no TODO events +180d"
                                          ;                 ((agenda "no TODO events +180d"
                                          ;                          ((org-agenda-span 180)
                                          ;                           (org-agenda-time-grid nil)
                                          ;                           (org-agenda-entry-types '(:timestamp :sexp))
                                          ;                           (org-agenda-skip-function
                                          ;                            '(or
                                          ;                              (org-agenda-skip-entry-if 'todo 'any);; skip if any TODO state is found
                                          ;                              (org-agenda-skip-entry-if 'category "infonova");; skip if any TODO state is found
                                          ;                              (my-skip-tag "lp")
                                          ;                              )
                                          ;                            )
                                          ;                           ;;(org-agenda-skip-function '(my-skip-tag "lp"))
                                          ;                          )))
                                          ;                 nil ("~/org/agenda_180d_filtered.html"))
                                          ;
                                          ;                ("D" "detail agenda"
                                          ;                 ((agenda "detail agenda"
                                          ;                          ((org-agenda-span 31)
                                          ;                           (org-agenda-time-grid nil)
                                          ;                          )))
                                          ;                 nil ("~/org/agenda_details.html"))
                                          ;
                                          ;                ("r" "reward tasks" (
                                          ;                                     (tags-todo "reward/!STARTED"
                                          ;                                                (
                                          ;                                                 (org-agenda-overriding-header "rewards: STARTED")
                                          ;                                                 ))
                                          ;                                     (tags-todo "reward/!NEXT"
                                          ;                                                (
                                          ;                                                 (org-agenda-overriding-header "rewards: NEXT")
                                          ;                                                 ))
                                          ;                                     (tags-todo "reward/!TODO"
                                          ;                                                (
                                          ;                                                 (org-agenda-overriding-header "rewards: TODO")
                                          ;                                                 ))
                                          ;                                     (tags-todo "reward/!SOMEDAY"
                                          ;                                                (
                                          ;                                                 (org-agenda-overriding-header "rewards: SOMEDAY")
                                          ;                                                 ))
                                          ;                                     ))
                                          ;                ("i" "issues" (
                                          ;                                     (tags-todo "issue/!STARTED"
                                          ;                                                (
                                          ;                                                 (org-agenda-overriding-header "issues: STARTED")
                                          ;                                                 ))
                                          ;                                     (tags-todo "issue/!NEXT"
                                          ;                                                (
                                          ;                                                 (org-agenda-overriding-header "issues: NEXT")
                                          ;                                                 ))
                                          ;                                     (tags-todo "issue/!TODO"
                                          ;                                                (
                                          ;                                                 (org-agenda-overriding-header "issues: TODO")
                                          ;                                                 ))
                                          ;                                     (tags-todo "issue/!SOMEDAY"
                                          ;                                                (
                                          ;                                                 (org-agenda-overriding-header "issues: SOMEDAY")
                                          ;                                                 ))
                                          ;                                     ))
                                          ;
                                          ;                ("$" "Shopping" tags "+Shopping"
                                          ;                 (
                                          ;                  (org-agenda-overriding-header "Shopping")
                                          ;                  (org-agenda-skip-function 'tag-without-done-or-canceled)
                                          ;                  ))
                                          ;
                                          ;                )))
#+end_src

#+RESULTS:
| a | Super Agenda         | agenda                                                                                                                                                                                                                                                                                                        |            | (org-super-agenda-mode)                                                                                           | ((org-super-agenda-groups my-super-agenda-groups)) | (org-agenda nil a) |
| A | Agenda               | agenda                                                                                                                                                                                                                                                                                                        |            | (org-agenda nil a)                                                                                                |                                                    |                    |
| n | no TODO events +180d | ((agenda no TODO events +180d ((org-agenda-span 180) (org-agenda-time-grid nil) (org-agenda-entry-types (quote (:timestamp :sexp))) (org-agenda-skip-function (quote (or (org-agenda-skip-entry-if (quote todo) (quote any)) (org-agenda-skip-entry-if (quote category) infonova) (my-skip-tag lp)))))))      | nil        | (~/org/agenda_180d_filtered.html)                                                                                 |                                                    |                    |
| D | detail agenda        | ((agenda detail agenda ((org-agenda-span 31) (org-agenda-time-grid nil))))                                                                                                                                                                                                                                    | nil        | (~/org/agenda_details.html)                                                                                       |                                                    |                    |
| r | reward tasks         | ((tags-todo reward/!STARTED ((org-agenda-overriding-header rewards: STARTED))) (tags-todo reward/!NEXT ((org-agenda-overriding-header rewards: NEXT))) (tags-todo reward/!TODO ((org-agenda-overriding-header rewards: TODO))) (tags-todo reward/!SOMEDAY ((org-agenda-overriding-header rewards: SOMEDAY)))) |            |                                                                                                                   |                                                    |                    |
| i | issues               | ((tags-todo issue/!STARTED ((org-agenda-overriding-header issues: STARTED))) (tags-todo issue/!NEXT ((org-agenda-overriding-header issues: NEXT))) (tags-todo issue/!TODO ((org-agenda-overriding-header issues: TODO))) (tags-todo issue/!SOMEDAY ((org-agenda-overriding-header issues: SOMEDAY))))         |            |                                                                                                                   |                                                    |                    |
| B | borrowed             | tags                                                                                                                                                                                                                                                                                                          | +borrowed  | ((org-agenda-overriding-header borrowed or lend) (org-agenda-skip-function (quote tag-without-done-or-canceled))) |                                                    |                    |
| $ | Besorgungen          | tags                                                                                                                                                                                                                                                                                                          | +Besorgung | ((org-agenda-overriding-header Besorgungen) (org-agenda-skip-function (quote tag-without-done-or-canceled)))      |                                                    |                    |

